spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
	if (progress_callback) progress_callback(95);

	m_cmd.dfu_jump();

	PMU::kick_watchdog();
	GPIOPins::init_pin(SAT_RESET);
	GPIOPins::clear(SAT_RESET);
	nrf_delay_ms(50);
	GPIOPins::release_to_highz(SAT_RESET);
	nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
	PMU::kick_watchdog();

	m_cmd.init();
	bool app_ready = false;
	for (uint8_t attempt = 0; attempt < 10; attempt++) {
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS / 2);
		PMU::kick_watchdog();
		if (m_cmd.ping()) {
			app_ready = true;
			break;
		}
	}

	if (app_ready) {
		m_new_firmware_version = get_firmware_version();
	}

	if (progress_callback) progress_callback(100);
	return DFU_RSP_OK;
}

SmdDfuResponse SmdSat::firmware_update_from_file(const std::string& filepath,
                                                 void (*progress_callback)(uint8_t percent)) {
	(void)filepath;
	(void)progress_callback;
	DEBUG_ERROR("SmdSat::%s: Not implemented", __func__);
	return DFU_RSP_ERROR;
}

std::string SmdSat::get_firmware_version() {
	DEBUG_TRACE("SmdSat::%s", __func__);

	bool was_stopped = (m_state == SmdSatState::stopped);

	if (was_stopped) {
		GPIOPins::acquire_sensors_pwr();
		GPIOPins::init_pin(SAT_RESET);
		GPIOPins::clear(SAT_RESET);
		nrf_delay_ms(10);
		GPIOPins::set(SAT_PWR_EN);
#ifdef SMD_VPA_PIN
		GPIOPins::release_to_highz(SMD_VPA_PIN);
#endif
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
		GPIOPins::release_to_highz(SAT_RESET);
		nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);
	}

	m_cmd.init();

	std::string version = "";

	try {
		bool smd_ready = false;
		for (uint8_t attempt = 0; attempt < 10; attempt++) {
			nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS / 2);
			if (m_cmd.ping()) {
				smd_ready = true;
				break;
			}
		}

		if (smd_ready) {
			uint8_t ver[64] = {0};
			m_cmd.read_version(ver);
			size_t len = 0;
			while (len < sizeof(ver) && ver[len] != 0 && ver[len] >= 0x20 && ver[len] < 0x7F) {
				len++;
			}
			version = std::string((char*)ver, len);
			DEBUG_INFO("SmdSat::%s: Firmware version: %s", __func__, version.c_str());
		}
	} catch (...) {
		DEBUG_ERROR("SmdSat::%s: Failed to read firmware version", __func__);
	}

	if (was_stopped) {
		m_cmd.deinit();
		shutdown();
		GPIOPins::release_sensors_pwr();
		nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);
	}

	return version;
}

std::string SmdSat::smd_spi_test() {
	return m_cmd.run_command_test();
}
